tutorials/fluidSolidInteraction/coupledTemperature/ras/hotRoom/constant/solid/thermalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermal
{
    type            constant;
    C               C [0 2 -2 -1 0 0 0] 500;
    k               k [1 1 -3 -1 0 0 0] 50;

    sources
    (
        solid
        {
            type            constant;
            S               S [1 -1 -3 0  0] 0;
            zones           ( solidZone );
        }
    );
}


// ************************************************************************* //
