tutorials/fluidSolidInteraction/coupledTemperature/ras/hotRoom/system/solid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

d2dt2Schemes
{
    default            backward;
}

ddtSchemes
{
    default            backward;
}

gradSchemes
{
    default            extendedLeastSquares 0;
}

divSchemes
{
    default            Gauss linear;
}

laplacianSchemes
{
    default            none;
    laplacian(k,T)     Gauss linear corrected;
}

snGradSchemes
{
    default            none;
}

interpolationSchemes
{
    default            none;
    interpolate(k) linear;
    interpolate(rhoC) linear;
}

// ************************************************************************* //
